# TextureRealWorldScaleX Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Gradient..::..TextureRealWorldScaleX Property
Gradient Class See Also
---
The property labeled "Size X" from the "Gradient" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string TextureRealWorldScaleX { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TextureRealWorldScaleX As String
	Get
```

Visual C++
---
```text
public:
static property String^ TextureRealWorldScaleX {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyDistance" with a minimum of "0.01".
# See Also
Gradient Class
Autodesk.Revit.DB.Visual Namespace